---
kind: property
id: P:Autodesk.Revit.DB.Analysis.HVACLoadType.HumidificationSetPoint
source: html/9eed2c32-b303-dfa8-e851-c4c152049a06.htm
---
# Autodesk.Revit.DB.Analysis.HVACLoadType.HumidificationSetPoint Property

The humidification set point as a number between 0 and 1.

## Syntax (C#)
```csharp
public double HumidificationSetPoint { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: